package kr.or.wabis.framework.contants;

public final class CmsConstant {
    
        
    // **********************************************************************************************************************//
    // 세션키 - 유저정보.
    // **********************************************************************************************************************//
    public final static String SESSION_USER = "SESSION_USER";
    public final static String SESSION_USER_AUTH = "SESSION_USER_AUTH";
    

    // **********************************************************************************************************************//
    // 사용자 타입
    // **********************************************************************************************************************//
    public final static String ROLE_ADMIN = "M"; // Manager
    public final static String ROLE_USER = "N";  // Normal
    

    // **********************************************************************************************************************//
    // 홈페이지 타입
    // **********************************************************************************************************************//
    public final static String HOMEPAGE_TYPE_F = "F"; // Front
    public final static String HOMEPAGE_TYPE_B = "B"; // Backend
    

    // **********************************************************************************************************************//
    // 메뉴 타입
    // **********************************************************************************************************************//
    public final static String MENU_TYPE_F = "F"; // Folder
    public final static String MENU_TYPE_C = "C"; // Contents
    public final static String MENU_TYPE_B = "B"; // Board
    public final static String MENU_TYPE_S = "S"; // Function
    public final static String MENU_TYPE_L = "L"; // Link

    
    // **********************************************************************************************************************//
    // 여부
    // **********************************************************************************************************************//
    public final static String Y = "Y"; // YES
    public final static String N = "N"; // NO
    
    
    // **********************************************************************************************************************//
    // 게시판 타입
    // **********************************************************************************************************************//
    public final static String BOARD_TYPE_N = "N"; // 목록형
    public final static String BOARD_TYPE_W = "W"; // 요약형
    public final static String BOARD_TYPE_A = "A"; // 앨범형
    public final static String BOARD_TYPE_Q = "Q"; // QnA형
    public final static String BOARD_TYPE_R = "R"; // 보고서형
    
    
    // **********************************************************************************************************************//
    // 성별
    // **********************************************************************************************************************//
    public final static String USER_GENDER_N = "M"; // 남
    public final static String USER_GENDER_W = "F"; // 여
    
    
}
